NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_FICR_NS</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FFC000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>UUID[%s]</name>
            <description>Description collection: 128-bit Universally Unique IDentifier (UUID).</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UUID</name>
                <description>Device UUID [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N7120</name>
                    <description>nRF7120</description>
                    <value>0x00071200</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>N7120E</name>
                    <description>nRF7120E</description>
                    <value>0x0007120E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Function variant code, Hardware version code, and Production configuration code encoded as ASCII.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Function variant code, Hardware version code, and Production configuration code encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AAB0</name>
                    <description>Example encoding for AAB0 - Function variant code AA, Hardware version code B, Production configuration code 0</description>
                    <value>0x41414230</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x024</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM size (KB)</description>
            <addressOffset>0x028</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM size (KB)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K1016</name>
                    <description>1016 kByte RAM</description>
                    <value>0x000003F8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MRAM</name>
            <description>MRAM size (KB)</description>
            <addressOffset>0x030</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MRAM</name>
                <description>MRAM size (KB)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K4076</name>
                    <description>4076 KByte MRAM</description>
                    <value>0x00000FEC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ER[%s]</name>
          <description>Description collection: Common encryption root key, word n</description>
          <addressOffset>0x380</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ER</name>
              <description>Encryption Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IR[%s]</name>
          <description>Description collection: Common identity root key, word n</description>
          <addressOffset>0x390</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IR</name>
              <description>Identity Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type</description>
          <addressOffset>0x3A0</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DEVICEADDR[%s]</name>
          <description>Description collection: Device address n</description>
          <addressOffset>0x3A4</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVICEADDR</name>
              <description>48 bit device address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>128</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Address of the register which will be written</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster: Data to be written into the register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Data</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>TAGHEADER0</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MFGID</name>
                <description>Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER1</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD4</name>
                <description>Unique identifier byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD5</name>
                <description>Unique identifier byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD6</name>
                <description>Unique identifier byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD7</name>
                <description>Unique identifier byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER2</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD8</name>
                <description>Unique identifier byte 8</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD9</name>
                <description>Unique identifier byte 9</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD10</name>
                <description>Unique identifier byte 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD11</name>
                <description>Unique identifier byte 11</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER3</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD12</name>
                <description>Unique identifier byte 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD13</name>
                <description>Unique identifier byte 13</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD14</name>
                <description>Unique identifier byte 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD15</name>
                <description>Unique identifier byte 15</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>MACADDR[%s]</name>
          <description>48-bit MAC address n</description>
          <headerStructName>FICR_MACADDR</headerStructName>
          <access>read-write</access>
          <addressOffset>0xC00</addressOffset>
          <register>
            <name>LOW</name>
            <description>Description cluster: Lower 24 bits of MAC address n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>MAC address bits [23:0]</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HIGH</name>
            <description>Description cluster: Upper 24 bits of MAC address n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>MAC address bits [47:24]</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>XTALCOMP</name>
          <description>Crystal oscillator (XTAL) temperature compensation data</description>
          <headerStructName>FICR_XTALCOMP</headerStructName>
          <access>read-write</access>
          <addressOffset>0xC20</addressOffset>
          <register>
            <name>OFFSET</name>
            <description>Measured XTAL frequency error at room temperature</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>Frequency error in ppm</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOWTEMPTHRESHOLD</name>
            <description>Low temperature threshold for frequency skew compensation</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>THRESHOLD</name>
                <description>Low temperature threshold</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOWTEMPADJUST</name>
            <description>Frequency adjustment applied below the low temperature threshold</description>
            <addressOffset>0x008</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADJUST</name>
                <description>Frequency adjustment in ppm</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
