NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_application.svd
        <register>
          <name>GAHBCFG</name>
          <description>AHB Configuration Register</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x0A000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GLBLINTRMSK</name>
              <description>Mode: Host and device. Global Interrupt Mask (GlblIntrMsk)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask the interrupt assertion to the application</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unmask the interrupt assertion to the application.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HBSTLEN</name>
              <description>Mode: Host and device. Burst Length/Type (HBstLen)</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD1ORSINGLE</name>
                  <description>1 word or single</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD4ORINCR</name>
                  <description>4 words or INCR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD8</name>
                  <description>8 words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD16ORINCR4</name>
                  <description>16 words or INCR4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD32</name>
                  <description>32 words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD64ORINCR8</name>
                  <description>64 words or INCR8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD128</name>
                  <description>128 words</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD256ORINCR16</name>
                  <description>256 words or INCR16</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORDX</name>
                  <description>Others reserved</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>Mode: Host and device. DMA Enable (DMAEn)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPLETERMODE</name>
                  <description>Core operates in Completer mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAMODE</name>
                  <description>Core operates in a DMA mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPTXFEMPLVL</name>
              <description>Mode: Host and device. Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALFEMPTY</name>
                  <description>DIEPINTn.TxFEmp interrupt indicates that the Non-Periodic TxFIFO is half empty or that the IN Endpoint TxFIFO is half empty.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is completely empty or that the IN Endpoint TxFIFO is completely empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTXFEMPLVL</name>
              <description>Mode: Host only. Periodic TxFIFO Empty Level (PTxFEmpLvl)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALFEMPTY</name>
                  <description>GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is half empty.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is completely empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMMEMSUPP</name>
              <description>Mode: Host and Device. Remote Memory Support (RemMemSupp)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Remote Memory Support Feature disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Remote Memory Support Feature enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTIALLDMAWRIT</name>
              <description>Mode: Host and Device. Notify All DMA Write Transactions (NotiAllDmaWrit)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LASTTRANS</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLTRANS</name>
                  <description>The core asserts int_dma_req for all the DMA write transactions on the AHB interface along with int_dma_done, chep_last_transact and chep_number signal informations. The core waits for sys_dma_done signal for all the DMA write transactions in order to complete the transfer of a particular Channel/Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBSINGLE</name>
              <description>Mode: Host and Device. AHB Single Support (AHBSingle)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCRBURST</name>
                  <description>The remaining data in the transfer is sent using INCR burst size</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBURST</name>
                  <description>The remaining data in the transfer is sent using Single burst size</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVDESCENDIANESS</name>
              <description>Mode: Host and Device. Invert Descriptor Endianess (InvDescEndianess)</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Descriptor Endianness is same as AHB Requester Endianness</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Descriptor Endianness is opposite to AHB Requester Endianness</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOAEOPCHECKCLKSBYTE</name>
              <description>Mode: Host. Number of clock cycles to check for EOP SE0 for LOA logic</description>
              <lsb>25</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Check for 2 clocks of EOP SE0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Check for 3 clocks of EOP SE0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOAEOPCHECKCLKSWORD</name>
              <description>Mode: Host. Number of clock cycles to check for EOP SE0 for LOA logic</description>
              <lsb>27</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Check for 2 clocks of EOP SE0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Check for 3 clocks of EOP SE0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GUSBCFG</name>
          <description>USB Configuration Register</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x10001400</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUTCAL</name>
              <description>Mode: Host and Device. HS/FS Timeout Calibration (TOutCal)</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Add 0 PHY clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Add 1 PHY clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Add 2 PHY clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Add 3 PHY clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Add 4 PHY clocks</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <description>Add 5 PHY clocks</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <description>Add 6 PHY clocks</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>Add 7 PHY clocks</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYIF</name>
              <description>Mode: Host and Device. PHY Interface (PHYIf)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS8</name>
                  <description>PHY 8bit Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS16</name>
                  <description>PHY 16bit Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPIUTMISEL</name>
              <description>Mode: Host and Device. ULPI or UTMI+ Select (ULPI_UTMI_Sel)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTMI</name>
                  <description>UTMI+ Interface</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPI</name>
                  <description>ULPI Interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSINTF</name>
              <description>Mode: Host and Device. Full-Speed Serial Interface Select (FSIntf)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FS6PIN</name>
                  <description>6-pin unidirectional full-speed serial interface</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FS3PIN</name>
                  <description>3-pin bidirectional full-speed serial interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYSEL</name>
              <description>PHYSel</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB20</name>
                  <description>USB 2.0 high-speed UTMI+ or ULPI PHY is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB11</name>
                  <description>USB 1.1 full-speed serial transceiver is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBTRDTIM</name>
              <description>Mode: Device only. USB Turnaround Time (USBTrdTim)</description>
              <lsb>10</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TURNTIME16BIT</name>
                  <description>MAC interface is 16-bit UTMI+.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TURNTIME8BIT</name>
                  <description>MAC interface is 8-bit UTMI+.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYLPWRCLKSEL</name>
              <description>PHY Low-Power Clock Select (PhyLPwrClkSel)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTPLLCLK</name>
                  <description>480-MHz Internal PLL clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>48-MHz External Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TERMSELDLPULSE</name>
              <description>Mode: Device only. TermSel DLine Pulsing Selection (TermSelDLPulse)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXVALID</name>
                  <description>Data line pulsing using utmi_txvalid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMSEL</name>
                  <description>Data line pulsing using utmi_termsel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICUSBCAP</name>
              <description>Mode: Host and Device. IC_USB-Capable (IC_USBCap)</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSELECTED</name>
                  <description>IC_USB PHY Interface is not selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECTED</name>
                  <description>IC_USB PHY Interface is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENDDELAY</name>
              <description>Mode: Device only. Tx End Delay (TxEndDelay)</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Tx End delay</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEHSTMODE</name>
              <description>Mode: Host and device. Force Host Mode (ForceHstMode)</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force Host Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEDEVMODE</name>
              <description>Mode:Host and device. Force Device Mode (ForceDevMode)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force Device Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORRUPTTXPKT</name>
              <description>Mode: Host and device. Corrupt Tx packet (CorruptTxPkt)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
